{
    "Basic": [
        "今天是XXX的第一次上課，主要的課程內容為讓學生熟悉上課方式以及遊戲的基本操作，並在熟悉操作後，讓學生蓋出數字的0~9，進一步的加強學生在操作上的熟練度。",
        "今天的課程內容為「L2 認識Agent」，學習了甚麼是Agent以及Agent程式專案的製作方法，並利用Agent專案建造圍牆以及樓梯。",
        "今天的課程內容為「L3 螺旋樓梯」，學習了「迴圈」以及「巢狀迴圈」的概念，並利用迴圈使Agent自動建造螺旋樓梯以及高牆。",
        "今天的課程內容為「L4 建造高塔」，一開始先建造一層牆壁，再利用「迴圈」的概念自動將一整個高塔建造出來，並在最後利用「巢狀迴圈」建造屋頂。",
        "今天的課程內容為「L5 引爆TNT」，學習了如何使用遊戲中的TNT(炸藥)，並建造了一個可以用來發射TNT的大砲，最後再使用Agent專案自動填充以及發射大砲。",
        "今天的上課內容為「L6 自動化西瓜農場」，首先手動建造了一個小型農田，並結合Agent專案，讓Agent自動來回巡視，當發現有西瓜生長出來時自動採收。",
        "今天的課程內容為「L7 發射煙火」，學習如何合成並使用遊戲內的煙火，並且學習了「隨機取數」的程式概念，讓程式的執行結果會更加多變，最後，利用Agent專案結合學習到的程式概念，製造隨機煙火秀。",
        "今天的上課內容為「L8 鵝卵石生產線」，在課程的一開始，學習了如何使用岩漿以及水來產生鵝卵石，並利用活塞建造簡單的紅石機關，製作出鵝卵石生產線，最後再使用Agent專案達成自動挖掘以及蒐集的效果。",
        "今天的上課內容為「L9 TNT大砲」，學習了如何使用遊戲中的TNT(炸藥)，並製作簡單的裝置來發射TNT，最後製作Agent專案自動裝填以及發射TNT大砲。",
        "今天的上課內容為「L10 火焰發射器」，學習了隨機取數的概念，並建造了能夠發射火焰箭矢的機關，結合Agent專案自動發射。",
        "今天的上課內容為「L11 紅石電路」，學習了現實中的邏輯閘功能，並在遊戲中利用紅石電路重現相同功能，並利用邏輯閘在遊戲中製作反覆閃爍的霓虹燈以及安全門。",
        "今天的課程內容為「L12 自動販賣機」，學習如何使用「漏斗」以及「紅石比較器」來製作「安全門」以及「自動販賣機」，回家後可以幫今天做的機關進行裝飾哦~",
        "今天的課程內容為「L13 自動化生產線」，分別建造了大烤箱以及大熔爐，並利用Agent自動放置雞在大烤箱中並點火，製作自動化烤雞裝置，接著再利用另一個Agent專案，在大熔爐上面自動建造鐵巨人，自動化生產鐵碇。",
        "今天的課程內容為「L14 雲霄飛車」，學習了遊戲中四種鐵軌以及三種礦車的使用方法及功能，並利用紅石機關搭配鐵路，製作方便的小機關。",
        "今天的課程內容為「L15 看誰愛跳水」，利用前面所學來製作一個猜測類型的機關，並利用Agent專案搭配紅石機關來控制遊戲。"
    ],  
    "Elite": [
        "今天的課程內容為「L1 觀察者自動農場」，學習了如何使用「觀察者」來製作機關，並建造一個大型的甘蔗自動收割機。",
        "今天的課程內容為「L2 金字塔守衛」，首先利用 Agent 專案建造金字塔，並製作另一個 Agent 專案，使 Agent 擁有守衛的功能。",
        "今天的上課內容為「L3 美妙音符方塊」，學習了如何看現實中音樂的簡譜，並學習了如何使用遊戲中的音符方塊製作音樂，最後建造了一個紅石自動門，並結合音符方塊簡單的製作全家便利商店的開門鈴聲。",
        "今天的上課內容為「L4 智能大考驗」，首先使用Agent專案在地上製作出了一個螺旋狀的通道，並且經過手動改造後，將螺旋通道變成迷宮，最後，再製作第二個Agent專案，使Agent能夠自動的在迷宮中找到出口。",
        "今天的上課內容為「L5 藥水魔法師」，首先學習了如何使用遊戲中的釀造臺，並學習了藥水的釀造方式及配方，再建造出一個大型的紅石機關自動釀藥水。",
        "今天的上課內容為「L6 麥田圈印表機」，利用Agent專案製作了複製圖形以及複製色彩的功能，讓Agent可以不斷的複製出相同的結構。",
        "今天的上課內容為「L7 狩獵遊戲」，課程開始首先讓同學們學習如何設置狩獵場，接著完成計分、計時設定和生成動物的程式方塊，進而完成狩獵遊戲的製作。",
        "今天的上課內容為「L8 超人換裝間」，一開始建造了淋浴間以及換裝間，並製作紅石機關自動穿上所選的裝備。",
        "今天的上課內容為「L9 猜拳遊戲」，利用變數以及隨機取數的概念，來讓Agent擁有猜拳的功能，並在最後利用函式的概念簡化Agent專案，使專案更容易製作以及維護。",
        "今天的上課內容為「L10 彩色隱藏門」，利用活塞以及紅石，製作一個有隱藏門機關的牆壁，並且設計謎題來引導玩家找出隱藏門。",
        "今天的上課內容為「L11 秘密圖書館」，利用之前所學製作關卡，並學習新的指令顯示遊戲提示給玩家。",
        "今天的上課內容為「L12 解謎達人」，利用紅石機關以及之前學過的邏輯閘，製作兩種不同的密碼鎖，並在場地內設置謎題，讓玩家能夠順利通關。",
        "今天的上課內容為「L13 快速傳輸器」，利用之前所學設定三個問答關卡，並設定 NPC 與玩家對話，並且在通關後快速傳送到下一個關卡。",
        "今天的上課內容為「L14 計時跑酷賽」，利用指令方塊來製作計時以及判斷是否通關，並自己設計關卡中的通關路線，製作獨一無二的關卡。",
        "今天上課的內容為「L15 成功破關王」，製作了找按鈕小遊戲，並利用粒子特效指令製作過關特效，最後再回到起點將製作的小遊戲初始化。"
    ],
    "Mix": [
        "今天的課程內容為「L1 攤販製造機」，利用 Agent 專案分別製作攤販的底部、柱子以及屋頂，並利用函式的概念將其組合。",
        "今天的上課內容為「L2 中央噴水池」，學習了「填充」積木如何使用，並利用Agent專案快速的鋪設地板，以及建造噴水池。",
        "今天的上課內容為「L3 遊戲攤販」，建造了旋轉木馬、扭蛋機以及售票販賣機，今天的課程主要偏向建築，並結合簡單的紅石機關使建築能夠帶有特殊功能。",
        "今天的上課內容為「L4 壽司攤販」，利用了活塞以及蜂蜜塊的特性製造一個能旋轉的運輸帶機關，讓放在上面的物品能像壽司店的軌道一樣自動旋轉，並利用指令方塊以及NPC，在玩家靠近時自動進入對話。",
        "今天的上課內容為「L5 商店街導覽員」，一開始我們利用了Agent專案製作了一個較小的隨機顏色燈飾用來測試程式是否正常，並利用變數的概念將燈飾放大，之後，建造了一面導覽牆，以及對應的NPC，方便玩家快速導覽這五堂課內製作出的地圖。",
        "今天的上課內容為「L6 射箭運動會」，學習了新的指令「clone 複製」，並利用新學會的指令製作可重複遊玩的射箭關卡。",
        "今天的上課內容為「L7 超級障礙賽」，學習了「生成」指令，並利用指令方塊、活塞以及礦車製作能持續運作的障礙賽關卡。",
        "今天的上課內容為「L8 怪物闖關賽」，使用以前所學，製作一個包含怪物的迷宮闖關關卡，並在玩家通關後顯示失敗次數以及通關花費時間，並判斷玩家是否成功通關。",
        "今天的上課內容為「L9 幸運跑酷賽」，學習了新的指令「effect 效果」，並結合以前所學，製作會觸發隨機事件的關卡，並製作復原以及計時功能。",
        "今天的上課內容為「L10 急速礦車手」，學習了如何使用「允許方塊」，並結合Agent以及鐵軌製作本周的關卡。",
        "今天的課程內容為「L11 雙人大富翁」，製作了大富翁遊戲中兩個玩家基本的移動、骰骰子等功能，並結合不同格子觸發不同事件。",
        "今天的課程內容為「L12 機會與命運」，在大富翁內加入隨機事件，在學習「隨機」概念進階用法的同時，也可以使遊戲更加完整、更具可玩性。",
        "今天的上課內容為「L13 道具商店」，在大富翁遊戲中加入前進道具以及後退道具，使製作出來的大富翁遊戲更多變化、更具策略性。",
        "今天的上課內容為接續製作大富翁的更多功能「L14 星星兌換站」，製作了兌換星星的功能，並以星星的數量決定遊戲勝利的玩家。",
        "今天的上課內容為「L15 大富翁機制」，製作了回合切換以及重置場地的功能，並學習了新的指令「replaceitem 取代物品」來防止玩家操作錯誤。"
    ],
    "Student": {
        "Good": [
            "今天XXX上課狀況良好，遇到問題會主動發問，並且有注意到機關的細節，很棒哦！",
            "今天XXX上課非常認真，並且在作品的外觀上有自己做改造，遇到問題或不確定時都會主動發問，很棒哦！",
            "今天XXX上課非常認真，並且在程式的部分會根據自己的想法做變化，很棒哦！",
            "今天XXX上課狀況良好，遇到問題會主動發問，並且完成的速度很快，很棒哦！",
            "今天XXX上課過程認真，遇到的問題在經老師講解後能正確理解，很棒哦！",
            "今天XXX上課狀況良好，能獨立完成課程目標，製作的速度很快且成品良好，很厲害哦！",
            "今天XXX上課狀況良好，幾乎可以獨立完成課程目標，且能理解課程內容，很厲害哦！",
            "今天XXX上課狀況良好，遇到問題會主動發問，並且成品良好，很棒哦！",
            "今天XXX上課認真，遇到問題會主動發問，且經老師解釋後能正確理解原理，很棒哦！",
            "最近XXX的上課態度一直保持著良好且專注，都能夠很快的完成老師要求的進度且不會分心，很棒哦！"
        ],
        "Bad": [
            "今天XXX在上課的一開始有一點點分心，在經過老師提醒後有明顯改善，後續製作認真且成品良好，下次要繼續保持哦！"
        ],
        "Uncomplete": [
            "由於本次課程需要打字的部分較多，因此完成的速度較慢，下次上課將繼續製作。",
            "今天XXX上課過程十分認真，但在製作過程中有一些不太知道怎麼做的部分，導致課程還有一部分尚未完成，下次將繼續製作，下次如果有遇到困難，可以多多舉手發問哦！",
            "這課需要完成的程式專案較複雜，因此今天XXX進度較緩慢，下次上課將繼續製作。"
        ]
    },
    "EX": "今天的動動腦時間介紹了「蜂蜜」在現實生活中的採集方法以及形成的方式，並在剩下的時間遊玩「戰橋」地圖，進一步加強遊戲的操作能力。"
}